ErpTest/src/InformationRegisters/пкШаблоныПодписейДокументов/пкШаблоныПодписейДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкШаблоныПодписейДокументов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПечатнойФормы</name>
    <type>
      <types>EnumRef.пкВидыПечатныхФормДляШаблоновПодписей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СПодписью</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подписант</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкШаблоныПодписейДокументов/Forms/ФормаЗаписи/Module.bsl
Перем ИмяВременногоФайла;
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ДанныеЗаписи = РегистрыСведений.пкШаблоныПодписейДокументов.ПолучитьПоследнее(Запись.Период, 
	//+++DubI Рарус-СПб 24.03.2017
		//Новый Структура("Наименование, Подразделение, ВидПечатнойФормы, СПодписью", Запись.Наименование, Запись.Подразделение, Запись.ВидПечатнойФормы, Запись.СПодписью));  
		Новый Структура("Наименование, Подразделение, ВидПечатнойФормы, СПодписью, Подписант", Запись.Наименование, Запись.Подразделение, Запись.ВидПечатнойФормы, Запись.СПодписью, Запись.Подписант));  
	//---DubI Рарус-СПб	
	
    ХранимоеЗначение = ДанныеЗаписи.Макет.Получить();
    
    Если ХранимоеЗначение <> НеОпределено Тогда
    	РасширениеВременногоФайла = ".mxl";
    	
    	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеВременногоФайла);
        
        Попытка
    		ХранимоеЗначение.Записать(ИмяВременногоФайла);
    	Исключение
    		Сообщить("Ошибка при сохранении файла: " + ОписаниеОшибки(), СтатусСообщения.Важное);
    		Возврат;
    	КонецПопытки;
    
    	ПолеРедактированияМакета.Прочитать(ИмяВременногоФайла);
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
        
    ПриЗакрытииНаСервере();
    
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
    
	ВременныйФайл = Новый Файл(ИмяВременногоФайла);

	Если ВременныйФайл.Существует() Тогда
		УдалитьФайлы(ИмяВременногоФайла);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
    
	Если НЕ ЗначениеЗаполнено(ИмяВременногоФайла) Тогда
		РасширениеВременногоФайла = ".mxl";
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(РасширениеВременногоФайла);
	КонецЕсли;
		
	ПолеРедактированияМакета.Записать(ИмяВременногоФайла);
	
	ВнешнийФайл = Новый ДвоичныеДанные(ИмяВременногоФайла);
    
    МенеджерЗаписи = РегистрыСведений.пкШаблоныПодписейДокументов.СоздатьМенеджерЗаписи();
	
	Запись.Пользователь = Пользователи.ТекущийПользователь();
	Запись.ДатаИзменения = ТекущаяДата();

	
    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
	    
	МенеджерЗаписи.Макет = Новый ХранилищеЗначения(ВнешнийФайл);
    
    МенеджерЗаписи.Записать();
    
КонецПроцедуры
